In [22]:
import pandas as pd
import numpy as np

In [2]:
data = {'color' : ['blue','green','yellow','red','white'],
        'object' : ['ball','pen','pencil','paper','mug'],
        'price' : [1.2,1.0,0.6,0.9,1.7]}

In [5]:
frame2 = pd.DataFrame(data, columns=['color','price'])
frame2

    color  price nombre
0    blue    1.2    NaN
1   green    1.0    NaN
2  yellow    0.6    NaN
3     red    0.9    NaN
4   white    1.7    NaN

In [7]:
frame2 = pd.DataFrame(data, columns=['color','price'], index = ['uno','dos','tres','cuatro','cinco'])
frame2

         color  price
uno       blue    1.2
dos      green    1.0
tres    yellow    0.6
cuatro     red    0.9
cinco    white    1.7

In [8]:
frame2['color']['dos']

'green'

In [10]:
frame2.iloc[1,1]

1.0

In [13]:
frame2.iloc[1:4,]

         color  price
dos      green    1.0
tres    yellow    0.6
cuatro     red    0.9

In [15]:
frame2.iloc[4]

color    white
price      1.7
Name: cinco, dtype: object

In [16]:
frame2.loc['cuatro']

color    red
price    0.9
Name: cuatro, dtype: object

In [20]:
frame2.reset_index(drop = True, inplace = True)

In [21]:
frame2

    color  price
0    blue    1.2
1   green    1.0
2  yellow    0.6
3     red    0.9
4   white    1.7

In [70]:
frame3 = pd.DataFrame(np.arange(16).reshape((4,4)),
                                           index = ['red','blue','yellow','white'],
                                           columns = ['ball','pen','pencil','paper'])

In [26]:
frame3.pencil

red        2
blue       6
yellow    10
white     14
Name: pencil, dtype: int32

In [27]:
frame3['pencil']

red        2
blue       6
yellow    10
white     14
Name: pencil, dtype: int32

In [28]:
frame3[['pencil','pen']]

        pencil  pen
red          2    1
blue         6    5
yellow      10    9
white       14   13

In [29]:
frame3.pencil.pen

AttributeError: 'Series' object has no attribute 'pen'

In [30]:
frame3.values

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15]])

In [33]:
frame3[:2,['pencil']]

TypeError: '(slice(None, 2, None), ['pencil'])' is an invalid key

In [34]:
frame3['nueva'] = 'dato'

In [36]:
frame3['nueva2'] = [i for i in range(len(frame3))]

In [37]:
frame3

        ball  pen  pencil  paper nueva  nueva2
red        0    1       2      3  dato       0
blue       4    5       6      7  dato       1
yellow     8    9      10     11  dato       2
white     12   13      14     15  dato       3

In [39]:
frame3.drop(['nueva','nueva2'], axis = 1, inplace = True)

In [43]:
frame3.drop('white', axis = 0, inplace = True)

In [45]:
help(pd.DataFrame.replace)

Help on function replace in module pandas.core.frame:

replace(self, to_replace=None, value=None, inplace=False, limit=None, regex=False, method='pad')
    Replace values given in `to_replace` with `value`.

    Values of the DataFrame are replaced with other values dynamically.
    This differs from updating with ``.loc`` or ``.iloc``, which require
    you to specify a location to update with some value.

    Parameters
    ----------
    to_replace : str, regex, list, dict, Series, int, float, or None
        How to find the values that will be replaced.

        * numeric, str or regex:

            - numeric: numeric values equal to `to_replace` will be
              replaced with `value`
            - str: string exactly matching `to_replace` will be replaced
              with `value`
            - regex: regexs matching `to_replace` will be replaced with
              `value`

        * list of str, regex, or numeric:

            - First, if `to_replace` and `value` are both lists, they
              **must** be the same length.
            - Second, if ``regex=True`` then all of the strings in **both**
              lists will be interpreted as regexs otherwise they will match
              directly. This doesn't matter much for `value` since there
              are only a few possible substitution regexes you can use.
            - str, regex and numeric rules apply as above.

        * dict:

            - Dicts can be used to specify different replacement values
              for different existing values. For example,
              ``{'a': 'b', 'y': 'z'}`` replaces the value 'a' with 'b' and
              'y' with 'z'. To use a dict in this way the `value`
              parameter should be `None`.
            - For a DataFrame a dict can specify that different values
              should be replaced in different columns. For example,
              ``{'a': 1, 'b': 'z'}`` looks for the value 1 in column 'a'
              and the value 'z' in column 'b' and replaces these values
              with whatever is specified in `value`. The `value` parameter
              should not be ``None`` in this case. You can treat this as a
              special case of passing two lists except that you are
              specifying the column to search in.
            - For a DataFrame nested dictionaries, e.g.,
              ``{'a': {'b': np.nan}}``, are read as follows: look in column
              'a' for the value 'b' and replace it with NaN. The `value`
              parameter should be ``None`` to use a nested dict in this
              way. You can nest regular expressions as well. Note that
              column names (the top-level dictionary keys in a nested
              dictionary) **cannot** be regular expressions.

        * None:

            - This means that the `regex` argument must be a string,
              compiled regular expression, or list, dict, ndarray or
              Series of such elements. If `value` is also ``None`` then
              this **must** be a nested dictionary or Series.

        See the examples section for examples of each of these.
    value : scalar, dict, list, str, regex, default None
        Value to replace any values matching `to_replace` with.
        For a DataFrame a dict of values can be used to specify which
        value to use for each column (columns not in the dict will not be
        filled). Regular expressions, strings and lists or dicts of such
        objects are also allowed.
    inplace : bool, default False
        If True, in place. Note: this will modify any
        other views on this object (e.g. a column from a DataFrame).
        Returns the caller if this is True.
    limit : int, default None
        Maximum size gap to forward or backward fill.
    regex : bool or same types as `to_replace`, default False
        Whether to interpret `to_replace` and/or `value` as regular
        expressions. If this is ``True`` then `to_replace` *must* be a
        string. Alternatively, this could be a regular expression or a
        list, dict, or array of regular expressions in which case
        `to_replace` must be ``None``.
    method : {'pad', 'ffill', 'bfill', `None`}
        The method to use when for replacement, when `to_replace` is a
        scalar, list or tuple and `value` is ``None``.

        .. versionchanged:: 0.23.0
            Added to DataFrame.

    Returns
    -------
    DataFrame
        Object after replacement.

    Raises
    ------
    AssertionError
        * If `regex` is not a ``bool`` and `to_replace` is not
          ``None``.
    TypeError
        * If `to_replace` is a ``dict`` and `value` is not a ``list``,
          ``dict``, ``ndarray``, or ``Series``
        * If `to_replace` is ``None`` and `regex` is not compilable
          into a regular expression or is a list, dict, ndarray, or
          Series.
        * When replacing multiple ``bool`` or ``datetime64`` objects and
          the arguments to `to_replace` does not match the type of the
          value being replaced
    ValueError
        * If a ``list`` or an ``ndarray`` is passed to `to_replace` and
          `value` but they are not the same length.

    See Also
    --------
    DataFrame.fillna : Fill NA values.
    DataFrame.where : Replace values based on boolean condition.
    Series.str.replace : Simple string replacement.

    Notes
    -----
    * Regex substitution is performed under the hood with ``re.sub``. The
      rules for substitution for ``re.sub`` are the same.
    * Regular expressions will only substitute on strings, meaning you
      cannot provide, for example, a regular expression matching floating
      point numbers and expect the columns in your frame that have a
      numeric dtype to be matched. However, if those floating point
      numbers *are* strings, then you can do this.
    * This method has *a lot* of options. You are encouraged to experiment
      and play with this method to gain intuition about how it works.
    * When dict is used as the `to_replace` value, it is like
      key(s) in the dict are the to_replace part and
      value(s) in the dict are the value parameter.

    Examples
    --------

    **Scalar `to_replace` and `value`**

    >>> s = pd.Series([0, 1, 2, 3, 4])
    >>> s.replace(0, 5)
    0    5
    1    1
    2    2
    3    3
    4    4
    dtype: int64

    >>> df = pd.DataFrame({'A': [0, 1, 2, 3, 4],
    ...                    'B': [5, 6, 7, 8, 9],
    ...                    'C': ['a', 'b', 'c', 'd', 'e']})
    >>> df.replace(0, 5)
       A  B  C
    0  5  5  a
    1  1  6  b
    2  2  7  c
    3  3  8  d
    4  4  9  e

    **List-like `to_replace`**

    >>> df.replace([0, 1, 2, 3], 4)
       A  B  C
    0  4  5  a
    1  4  6  b
    2  4  7  c
    3  4  8  d
    4  4  9  e

    >>> df.replace([0, 1, 2, 3], [4, 3, 2, 1])
       A  B  C
    0  4  5  a
    1  3  6  b
    2  2  7  c
    3  1  8  d
    4  4  9  e

    >>> s.replace([1, 2], method='bfill')
    0    0
    1    3
    2    3
    3    3
    4    4
    dtype: int64

    **dict-like `to_replace`**

    >>> df.replace({0: 10, 1: 100})
         A  B  C
    0   10  5  a
    1  100  6  b
    2    2  7  c
    3    3  8  d
    4    4  9  e

    >>> df.replace({'A': 0, 'B': 5}, 100)
         A    B  C
    0  100  100  a
    1    1    6  b
    2    2    7  c
    3    3    8  d
    4    4    9  e

    >>> df.replace({'A': {0: 100, 4: 400}})
         A  B  C
    0  100  5  a
    1    1  6  b
    2    2  7  c
    3    3  8  d
    4  400  9  e

    **Regular expression `to_replace`**

    >>> df = pd.DataFrame({'A': ['bat', 'foo', 'bait'],
    ...                    'B': ['abc', 'bar', 'xyz']})
    >>> df.replace(to_replace=r'^ba.$', value='new', regex=True)
          A    B
    0   new  abc
    1   foo  new
    2  bait  xyz

    >>> df.replace({'A': r'^ba.$'}, {'A': 'new'}, regex=True)
          A    B
    0   new  abc
    1   foo  bar
    2  bait  xyz

    >>> df.replace(regex=r'^ba.$', value='new')
          A    B
    0   new  abc
    1   foo  new
    2  bait  xyz

    >>> df.replace(regex={r'^ba.$': 'new', 'foo': 'xyz'})
          A    B
    0   new  abc
    1   xyz  new
    2  bait  xyz

    >>> df.replace(regex=[r'^ba.$', 'foo'], value='new')
          A    B
    0   new  abc
    1   new  new
    2  bait  xyz

    Note that when replacing multiple ``bool`` or ``datetime64`` objects,
    the data types in the `to_replace` parameter must match the data
    type of the value being replaced:

    >>> df = pd.DataFrame({'A': [True, False, True],
    ...                    'B': [False, True, False]})
    >>> df.replace({'a string': 'new value', True: False})  # raises
    Traceback (most recent call last):
        ...
    TypeError: Cannot compare types 'ndarray(dtype=bool)' and 'str'

    This raises a ``TypeError`` because one of the ``dict`` keys is not of
    the correct type for replacement.

    Compare the behavior of ``s.replace({'a': None})`` and
    ``s.replace('a', None)`` to understand the peculiarities
    of the `to_replace` parameter:

    >>> s = pd.Series([10, 'a', 'a', 'b', 'a'])

    When one uses a dict as the `to_replace` value, it is like the
    value(s) in the dict are equal to the `value` parameter.
    ``s.replace({'a': None})`` is equivalent to
    ``s.replace(to_replace={'a': None}, value=None, method=None)``:

    >>> s.replace({'a': None})
    0      10
    1    None
    2    None
    3       b
    4    None
    dtype: object

    When ``value=None`` and `to_replace` is a scalar, list or
    tuple, `replace` uses the method parameter (default 'pad') to do the
    replacement. So this is why the 'a' values are being replaced by 10
    in rows 1 and 2 and 'b' in row 4 in this case.
    The command ``s.replace('a', None)`` is actually equivalent to
    ``s.replace(to_replace='a', value=None, method='pad')``:

    >>> s.replace('a', None)
    0    10
    1    10
    2    10
    3     b
    4     b
    dtype: object

In [50]:
frame3.loc['yellow','paper'] = 20

In [51]:
frame3

        ball  pen  pencil  paper
red        0    1       2      3
blue       4    5       6      7
yellow     8    9      10     20

In [52]:
frame3.replace(20,11,inplace = True)

In [53]:
frame3

        ball  pen  pencil  paper
red        0    1       2      3
blue       4    5       6      7
yellow     8    9      10     11

In [54]:
frame3.at['yellow','paper'] = 24

In [58]:
frame3.T

        red  blue  yellow
ball      0     4       8
pen       1     5       9
pencil    2     6      10
paper     3     7      24

In [62]:
frame3.rename(columns = {'pen':'pen2'}, inplace = True)

In [63]:
frame3

        ball  pen2  pencil  paper
red        0     1       2      3
blue       4     5       6      7
yellow     8     9      10     24

In [65]:
frame3.columns = ['ball2','pen3','pencil2','paper2']

In [69]:
frame3.columns[0] = 'ball3'

TypeError: Index does not support mutable operations

In [72]:
frame3/2

        ball  pen  pencil  paper
red      0.0  0.5     1.0    1.5
blue     2.0  2.5     3.0    3.5
yellow   4.0  4.5     5.0    5.5
white    6.0  6.5     7.0    7.5

In [73]:
np.sqrt(frame3)

            ball       pen    pencil     paper
red     0.000000  1.000000  1.414214  1.732051
blue    2.000000  2.236068  2.449490  2.645751
yellow  2.828427  3.000000  3.162278  3.316625
white   3.464102  3.605551  3.741657  3.872983

In [74]:
f = lambda x: x.max()-x.min()

In [77]:
frame3.apply(f, axis = 1)

red       3
blue      3
yellow    3
white     3
dtype: int64

In [78]:
frame3.apply(f)

ball      12
pen       12
pencil    12
paper     12
dtype: int64

In [79]:
def f(x):
    return pd.Series([x.min(),x.max()], index = ['min','max'])

In [80]:
frame3.apply(f)

     ball  pen  pencil  paper
min     0    1       2      3
max    12   13      14     15

In [81]:
frame3.apply(f, axis = 1)

        min  max
red       0    3
blue      4    7
yellow    8   11
white    12   15

In [83]:
frame3.sum()

ball      24
pen       28
pencil    32
paper     36
dtype: int64

In [84]:
frame3.mean()

ball      6.0
pen       7.0
pencil    8.0
paper     9.0
dtype: float64

In [85]:
frame3.describe()

            ball        pen     pencil      paper
count   4.000000   4.000000   4.000000   4.000000
mean    6.000000   7.000000   8.000000   9.000000
std     5.163978   5.163978   5.163978   5.163978
min     0.000000   1.000000   2.000000   3.000000
25%     3.000000   4.000000   5.000000   6.000000
50%     6.000000   7.000000   8.000000   9.000000
75%     9.000000  10.000000  11.000000  12.000000
max    12.000000  13.000000  14.000000  15.000000

In [88]:
frame3.sort_values(by = 'pen', ascending = False)

        ball  pen  pencil  paper
white     12   13      14     15
yellow     8    9      10     11
blue       4    5       6      7
red        0    1       2      3

In [91]:
frame3.sort_index()

        ball  pen  pencil  paper
blue       4    5       6      7
red        0    1       2      3
white     12   13      14     15
yellow     8    9      10     11

In [92]:
ser = pd.Series([0,1,2,np.NaN,9],
                index=['red','blue','yellow','white','green'])

In [95]:
ser[ser.isnull()]

white   NaN
dtype: float64

In [96]:
ser[ser.notnull()]

red       0.0
blue      1.0
yellow    2.0
green     9.0
dtype: float64

In [97]:
ser.fillna(4)

red       0.0
blue      1.0
yellow    2.0
white     4.0
green     9.0
dtype: float64